//整数数组 nums 按升序排列，数组中的值 互不相同 。 
//
// 在传递给函数之前，nums 在预先未知的某个下标 k（0 <= k < nums.length）上进行了 旋转，使数组变为 [nums[k], nums[
//k+1], ..., nums[n-1], nums[0], nums[1], ..., nums[k-1]]（下标 从 0 开始 计数）。例如， [0,1,2
//,4,5,6,7] 在下标 3 处经旋转后可能变为 [4,5,6,7,0,1,2] 。 
//
// 给你 旋转后 的数组 nums 和一个整数 target ，如果 nums 中存在这个目标值 target ，则返回它的下标，否则返回 -1 。 
//
// 
//
// 示例 1： 
//
// 
//输入：nums = [4,5,6,7,0,1,2], target = 0
//输出：4
// 
//
// 示例 2： 
//
// 
//输入：nums = [4,5,6,7,0,1,2], target = 3
//输出：-1 
//
// 示例 3： 
//
// 
//输入：nums = [1], target = 0
//输出：-1
// 
//
// 
//
// 提示： 
//
// 
// 1 <= nums.length <= 5000 
// -10^4 <= nums[i] <= 10^4 
// nums 中的每个值都 独一无二 
// 题目数据保证 nums 在预先未知的某个下标上进行了旋转 
// -10^4 <= target <= 10^4 
// 
//
// 
//
// 进阶：你可以设计一个时间复杂度为 O(log n) 的解决方案吗？ 
// Related Topics 数组 二分查找 
// 👍 1446 👎 0


//leetcode submit region begin(Prohibit modification and deletion)
class Solution {
    public int search(int[] nums, int target) {
        int start = 0;
        int end = nums.length - 1;
        //[left , right] 左右闭区间，能取到 left right 索引处的值
        while (start <= end) {
            int mid = start + (end - start) / 2;
            if (nums[mid] == target) {
                return mid;
            }
            //代表左半边是有序的
            if (nums[start] <= nums[mid]) {    //{7, 6, 0, 1, 2}
                //如果target在左半部分
                //注意，因为是左右两端都是闭区间，所以target在与两端比较的时候一定要带有=（相等的情况）
                if (target >= nums[start] && target < nums[mid]) {
                    //往两边发散，end往start方向移动
                    end = mid - 1;
                } else {
                    //start往end方向移动
                    start = mid + 1;
                }
            } else {    //右半部分是有序的
                //如果target在右半部分
                //注意，因为是左右两端都是闭区间，所以target在与两端比较的时候一定要带有=（相等的情况）
                if (target > nums[mid] && target <= nums[end]) {
                    //start往end方向移动，大原则是从mid往两边发散
                    start = mid + 1;
                } else {
                    //emd往start方向移动
                    end = mid - 1;
                }
            }
        }
        return -1;
    }
}
//leetcode submit region end(Prohibit modification and deletion)
